Revit 2026 API

# AnalyticalDistributionNodePropertyData Properties

---

The AnalyticalDistributionNodePropertyData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectedPhases | The electrical connected phases of the electrical analytical node to its upstream node. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

AnalyticalDistributionNodePropertyData Class

Autodesk.Revit.DB.Electrical Namespace